# Реализовать функцию my_func(),
# которая принимает три позиционных аргумента и
# возвращает сумму наибольших двух аргументов.

def my_func(a, b, c):
    foi
    i in range(my_func)
    print(sum(max(my_func)))
    return


print(int(input('Введите 3 числа: ')))
