#Пользователь вводит месяц в виде целого числа от 1 до 12.
# Сообщить, к какому времени года относится месяц (зима, весна, лето, осень).
# Напишите решения через list и dict.

month_number = int(input('Введите число от 1 до 12: '))

season_number = {1: "Зима",
           2: "Зима",
           3: "Весна",
           4: "Весна",
           5: "Весна",
           6: "Лето",
           7: "Лето",
           8: "Лето",
           9: "Осень",
           10: "Осень",
           11: "Осень",
           12: "Зима"}

if month_number in season_number:
    print(season_number[month_number])
else:
    print("Введите корректное значение!")